---
kind: method
id: M:Autodesk.Revit.DB.Categories.Contains(System.String)
source: html/26ed0ffb-eeeb-7be1-4979-ac917eac698e.htm
---
# Autodesk.Revit.DB.Categories.Contains Method

Identifies if a category which has the specified name is in the list of top-level categories.

## Syntax (C#)
```csharp
public override bool Contains(
	string name
)
```

## Parameters
- **name** (`System.String`) - The name of the category to be retrieved.